app/controllers/products_controller.rb

  def index

    @products = Product.paginate(:page => params[:page], :per_page => 6)
---
SELECT "products".* FROM "products" WHERE (name LIKE '%%')

  def show
    @comments = @product.comments.paginate(page: params[:page], per_page: 2)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."product_id" = ?  [["product_id", 1]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour", "price") VALUES (?, ?, ?, ?, ?, ?, ?)