app/controllers/static_pages_controller.rb

SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 9]]
---
  def landing_page
  	@products = Product.limit(9)